In [1]:
import numpy as np
import pandas as pd

In [3]:
label = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [4]:
arr

array([10, 20, 30])

In [7]:
pd.Series(data=my_data,index=label) #Using series we get indexing involved with numpy arrays

a    10
b    20
c    30
dtype: int64

In [8]:
#Diff btw a numpy array and a panda series is that panda series can hold a variety of objects
pd.Series(data=[sum,len,print])
#panda series is flexible to hold different object types

0      <built-in function sum>
1      <built-in function len>
2    <built-in function print>
dtype: object

In [11]:
ser1 = pd.Series([1,2,3,4],['India','Myanmmar','Switzerland','Ladakh'])
ser1

India          1
Myanmmar       2
Switzerland    3
Ladakh         4
dtype: int64

In [12]:
ser1['India']

1

In [14]:
from numpy.random import randn
np.random.seed(101)

In [20]:
#Pandas Dataframes
df = pd.DataFrame(data=randn(5,4),index=['X','Y','Z','P','Q'],columns=['A','B','C','D'])
df #dataframe is a bunch of series that share the same index

          A         B         C         D
X  0.166905  0.184502  0.807706  0.072960
Y  0.638787  0.329646 -0.497104 -0.754070
Z -0.943406  0.484752 -0.116773  1.901755
P  0.238127  1.996652 -0.993263  0.196800
Q -1.136645  0.000366  1.025984 -0.156598

In [21]:
df['A'] #looks like a pandas series

X    0.166905
Y    0.638787
Z   -0.943406
P    0.238127
Q   -1.136645
Name: A, dtype: float64

In [22]:
type(df)

pandas.core.frame.DataFrame

In [23]:
df[['A','B']]

          A         B
X  0.166905  0.184502
Y  0.638787  0.329646
Z -0.943406  0.484752
P  0.238127  1.996652
Q -1.136645  0.000366

In [27]:
#Creating a new column
df['E'] = df['A'] + df['B']
df[['A','B','E']]
df

          A         B         C         D         E
X  0.166905  0.184502  0.807706  0.072960  0.351406
Y  0.638787  0.329646 -0.497104 -0.754070  0.968433
Z -0.943406  0.484752 -0.116773  1.901755 -0.458655
P  0.238127  1.996652 -0.993263  0.196800  2.234779
Q -1.136645  0.000366  1.025984 -0.156598 -1.136278

In [32]:
#Removing columns
df.drop('E',axis=1,inplace=True) #axis=1 specifies the column
                                 #axis=0 specifies the index
                                 #inplace=True signifies that column is permanently removed

In [33]:
df

          A         B         C         D
X  0.166905  0.184502  0.807706  0.072960
Y  0.638787  0.329646 -0.497104 -0.754070
Z -0.943406  0.484752 -0.116773  1.901755
P  0.238127  1.996652 -0.993263  0.196800
Q -1.136645  0.000366  1.025984 -0.156598

In [34]:
df.shape #returns a tuple

(5, 4)

In [36]:
df.loc['Z']

A   -0.943406
B    0.484752
C   -0.116773
D    1.901755
Name: Z, dtype: float64

In [37]:
df.iloc[2]

A   -0.943406
B    0.484752
C   -0.116773
D    1.901755
Name: Z, dtype: float64

In [38]:
#Getting a subset return of the dataframe
df.loc[['X','Y'],['A','B']]

          A         B
X  0.166905  0.184502
Y  0.638787  0.329646

In [40]:
#Conditional selection
booldf = df > 0

In [42]:
df[booldf] #nan where the condition is not satisfied

          A         B         C         D
X  0.166905  0.184502  0.807706  0.072960
Y  0.638787  0.329646       NaN       NaN
Z       NaN  0.484752       NaN  1.901755
P  0.238127  1.996652       NaN  0.196800
Q       NaN  0.000366  1.025984       NaN

In [47]:
df[df['A']>0] #the type of conditional statements we are going to use in dataframes

          A         B         C        D
X  0.166905  0.184502  0.807706  0.07296
Y  0.638787  0.329646 -0.497104 -0.75407
P  0.238127  1.996652 -0.993263  0.19680

In [49]:
df[df['A']>0]['B'] #We can stack commands

X    0.184502
Y    0.329646
P    1.996652
Name: B, dtype: float64

In [53]:
df[df['A']>0][['B','D']] #one-line abstraction

          B        D
X  0.184502  0.07296
Y  0.329646 -0.75407
P  1.996652  0.19680

In [55]:
boolser=df['A']>0
result=df[boolser]
mycols=['B','C']
result[mycols]

          B         C
X  0.184502  0.807706
Y  0.329646 -0.497104
P  1.996652 -0.993263

In [57]:
#using multiple conditions by using &
df[(df['A']>0) & (df['B']>0)]

          A         B         C        D
X  0.166905  0.184502  0.807706  0.07296
Y  0.638787  0.329646 -0.497104 -0.75407
P  0.238127  1.996652 -0.993263  0.19680

In [58]:
df.reset_index()

  index         A         B         C         D
0     X  0.166905  0.184502  0.807706  0.072960
1     Y  0.638787  0.329646 -0.497104 -0.754070
2     Z -0.943406  0.484752 -0.116773  1.901755
3     P  0.238127  1.996652 -0.993263  0.196800
4     Q -1.136645  0.000366  1.025984 -0.156598

In [60]:
newind='WB CHD JK MG UKT'.split() #quick way to create list
newind

['WB', 'CHD', 'JK', 'MG', 'UKT']

In [61]:
df['States']=newind
df

          A         B         C         D States
X  0.166905  0.184502  0.807706  0.072960     WB
Y  0.638787  0.329646 -0.497104 -0.754070    CHD
Z -0.943406  0.484752 -0.116773  1.901755     JK
P  0.238127  1.996652 -0.993263  0.196800     MG
Q -1.136645  0.000366  1.025984 -0.156598    UKT

In [64]:
df.set_index('States')

               A         B         C         D
States
WB      0.166905  0.184502  0.807706  0.072960
CHD     0.638787  0.329646 -0.497104 -0.754070
JK     -0.943406  0.484752 -0.116773  1.901755
MG      0.238127  1.996652 -0.993263  0.196800
UKT    -1.136645  0.000366  1.025984 -0.156598

In [68]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1 -0.162535  0.485809
   2  0.392489  0.221491
   3 -0.855196  1.541990
G2 1  0.666319 -0.538235
   2 -0.568581  1.407338
   3  0.641806 -0.905100

In [70]:
df.loc['G1'].loc[2]['B']

0.22149068500354543

In [75]:
#returns a cross-section of rows and columns
df.index.names=['Groups','Num']
df.xs('G1') #it has the ability to go inside the multilevel index

            A         B
Num
1   -0.162535  0.485809
2    0.392489  0.221491
3   -0.855196  1.541990

In [76]:
df.xs(1,level='Num')

               A         B
Groups
G1     -0.162535  0.485809
G2      0.666319 -0.538235

In [11]:
#missing data
import numpy as np
import pandas as pd
d = {'A':[1,2,3],'B':[2,np.nan,np.nan],'C':[1.0,np.nan,1.0]}
df = pd.DataFrame(d)
df

   A    B    C
0  1  2.0  1.0
1  2  NaN  NaN
2  3  NaN  1.0

In [4]:
df.dropna() #pandas would drop any row with any of the missing value

   A    B    C
0  1  2.0  0.5

In [5]:
df.dropna(axis=1) #drop columns with null value

   A
0  1
1  2
2  3

In [6]:
df.dropna(thresh=2) #drop row with more than two non nan value

   A    B    C
0  1  2.0  0.5
2  3  NaN  1.0

In [8]:
#Replacing missing values
df.fillna(value='FILL VALUE')

   A           B           C
0  1           2         0.5
1  2  FILL VALUE  FILL VALUE
2  3  FILL VALUE           1

In [14]:
df['C'].fillna(value=df['C'].mean())

0    1.0
1    1.0
2    1.0
Name: C, dtype: float64

In [12]:
df

   A    B    C
0  1  2.0  1.0
1  2  NaN  NaN
2  3  NaN  1.0

In [17]:
#Groupby method 
#performs some aggregate function on group of columns
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['SAM','FRO','FABRIZIO','FROZ','ROSE','FG'],
        'Sales':[200,340,450,54,340,67]}

In [18]:
df = pd.DataFrame(data)
df

  Company    Person  Sales
0    GOOG       SAM    200
1    GOOG       FRO    340
2    MSFT  FABRIZIO    450
3    MSFT      FROZ     54
4      FB      ROSE    340
5      FB        FG     67

In [19]:
#groupby column
byComp = df.groupby('Company')

In [20]:
byComp.mean()

         Sales
Company
FB       203.5
GOOG     270.0
MSFT     252.0

In [21]:
byComp.sum().loc['FB']

Sales    407
Name: FB, dtype: int64

In [22]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [23]:
df.groupby('Company').max()

        Person  Sales
Company
FB        ROSE    340
GOOG       SAM    340
MSFT      FROZ    450

In [25]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     203.500000
       std      193.040151
       min       67.000000
       25%      135.250000
       50%      203.500000
       75%      271.750000
       max      340.000000
Name: FB, dtype: float64

In [ ]:
#Merging,joining,concatenating dataframes
pd.concat([df1,df2,df3]) to concatenate the dataframes

In [ ]:
pd.merge([df1,df2,how='inner',on='key']) to merge the columns based on key column
pd.merge([df1,df2,on=['key1','key2']]) #to pass a list of keys to merge

In [ ]:
#Joining is a convenient method for combining the columns of two potentially differently indexed
#dataframes into a single result dataframes
df1.join(df2)

In [27]:
#Operations
d = {'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':[3,4,5,6]}
df=pd.DataFrame(d)
df.head() #return the first n rows

   col1  col2  col3
0     1   444     3
1     2   555     4
2     3   666     5
3     4   444     6

In [28]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [29]:
df['col2'].nunique()

3

In [30]:
df[df['col1']>2]

   col1  col2  col3
2     3   666     5
3     4   444     6

In [33]:
#Applying our own custom function
def times2(num):
    return num*2

In [31]:
df['col1'].sum()

10

In [34]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [35]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [36]:
df.sort_values('col2')

   col1  col2  col3
0     1   444     3
3     4   444     6
1     2   555     4
2     3   666     5

In [38]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [47]:
#Data input and output 
#CSV,HTML,Excel,SQL
#pd.read_csv('C:/Users/ACER/Desktop/example.csv')

In [48]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\acer\anaconda3\lib\site-packages (1.3.1)
Note: you may need to restart the kernel to use updated packages.

In [49]:
pip install lxml

Requirement already satisfied: lxml in c:\users\acer\anaconda3\lib\site-packages (4.3.2)
Note: you may need to restart the kernel to use updated packages.

In [50]:
pip install html5lib

Requirement already satisfied: html5lib in c:\users\acer\anaconda3\lib\site-packages (1.0.1)
Requirement already satisfied: webencodings in c:\users\acer\anaconda3\lib\site-packages (from html5lib) (0.5.1)
Requirement already satisfied: six>=1.9 in c:\users\acer\anaconda3\lib\site-packages (from html5lib) (1.12.0)
Note: you may need to restart the kernel to use updated packages.

In [51]:
pip install BeautifulSoup4

Requirement already satisfied: BeautifulSoup4 in c:\users\acer\anaconda3\lib\site-packages (4.7.1)
Requirement already satisfied: soupsieve>=1.2 in c:\users\acer\anaconda3\lib\site-packages (from BeautifulSoup4) (1.8)
Note: you may need to restart the kernel to use updated packages.

In [53]:
#pd.read_excel('route.lxml')

In [ ]:
df = pd.read_csv('example.csv')
df.to_csv('My Output',index=False) #We can save to any format as asked
pd.read_csv('My Output')

In [54]:
df=pd.read_excel('C:/Users/ACER/Desktop/example.xlsx',sheetname='Sheet1')

C:\Users\ACER\Anaconda3\lib\site-packages\pandas\util\_decorators.py:188: FutureWarning: The `sheetname` keyword is deprecated, use `sheet_name` instead
  return func(*args, **kwargs)

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [55]:
df.to_excel('example2.xlsx',sheet_name='NewSheet')

In [58]:
pd.read_excel('example2.xlsx',sheetname='NewSheet')

C:\Users\ACER\Anaconda3\lib\site-packages\pandas\util\_decorators.py:188: FutureWarning: The `sheetname` keyword is deprecated, use `sheet_name` instead
  return func(*args, **kwargs)

   Unnamed: 0  col1  col2  col3
0           0     1   444     3
1           1     2   555     4
2           2     3   666     5
3           3     4   444     6

In [ ]:
data=pd.read_html('')

In [59]:
from sqlalchemy import create_engine

In [60]:
engine = create_engine('sqlite:///:memory:')

In [62]:
df.to_sql('example',engine)
sqldf= pd.read_sql('example',con=engine)
sqldf

   index  col1  col2  col3
0      0     1   444     3
1      1     2   555     4
2      2     3   666     5
3      3     4   444     6